#pragma once
#include <vector>

/**
 * @brief Інтерфейс для алгоритмів сортування.
 *
 * Цей інтерфейс задає контракт для будь-якого класу, що реалізує алгоритм сортування.
 * Дає змогу працювати з різними реалізаціями (послідовними, паралельними тощо) за єдиним інтерфейсом.
 */
class ISorter {
public:
    /**
     * @brief Сортує вхідний масив даних.
     *
     * @param data Вектор цілих чисел, який потрібно відсортувати.
     */
    virtual void sort(std::vector<int>& data) = 0;

    /**
     * @brief Віртуальний деструктор.
     *
     * Забезпечує коректне знищення об'єктів-нащадків через вказівник на базовий клас.
     */
    virtual ~ISorter() = default;
};
